app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY name DESC
---
	def index
		@categories = Category.find_each.order('name')

SELECT "categories".* FROM "categories" ORDER BY name
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
		@categories = Category.find_each.order('name')
		@category = Category.friendly.find(params[:id])