app/controllers/coins_controller.rb

	def index
		page_title = "Coins"
		coins = Coin.all
---
SELECT "coins".* FROM "coins"

	def show
		@coin = Coin.friendly.find(params[:id])
---
SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@use_ajax = false
		@coin = Coin.friendly.find(params[:id])
---
SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@coin = Coin.new(coin_params)
	    if @coin.save
---
INSERT INTO "coins" ("name", "coin_info", "coin_status", "application_name", "application_description", "application_status", "category_id", "created_at", "updated_at", "logo", "application_url", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@coin = Coin.friendly.find(params[:id])
	  	if @coin.update_attributes(coin_params)
---
SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "coins" SET "has_application" = ?, "application_status" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["has_application", true], ["application_status", ""], ["updated_at", 2016-08-01 15:09:01 UTC], ["id", 5]]