app/views/categories/_all_categories.html.erb

SELECT "coins".* FROM "coins" WHERE "coins"."category_id" = ?  [["category_id", 3]]
---
<% @categories.each do |category| %>
	<% unless category.coins.empty? %>