app/views/categories/_category_menu.html.erb

		<% @categories.each do |category| %>
			<% unless category.coins.empty? %>
---
SELECT  1 AS one FROM "coins" WHERE "coins"."category_id" = ? LIMIT ?  [["category_id", 3], ["LIMIT", 1]]
SELECT "coins".* FROM "coins" WHERE "coins"."category_id" = ?  [["category_id", 3]]