app/views/coins/_form.html.erb

		<div class="col-md-8">
			<%= f.select :coin_status, Coin.coin_status_options.keys.to_a %>
---
SELECT "statuses".* FROM "statuses" ORDER BY "statuses"."created_at" ASC